# 1- Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, 
# является ли этот день выходным.

# *Пример:*
# - 6 -> да
# - 7 -> да
# - 1 -> нет

print('введи цифру, обозначающую день недели, и я скажу, является ли этот день выходным: ')
number = int(input())
if number == 1: print('нет, это не выходной')
if number == 2: print('нет, это не выходной')
if number == 3: print('нет, это не выходной')
if number == 4: print('нет, это не выходной')
if number == 5: print('нет, это не выходной')
if number == 6: print('да, это выходной')
if number == 7: print('да, это выходной')

